public/2022/code_interview/training.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-06-21 Tue 23:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Claudio Parra">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" type="text/css" href="../style.css">
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org01e1879"><code>[2/2]</code> Leetcode Exercises <span class="timestamp-wrapper"><span class="timestamp">[2022-06-21 Tue]</span></span></a>
<ul>
<li><a href="#org42e024d"><span class="done DONE">DONE</span> Two Sum&#xa0;&#xa0;&#xa0;<span class="tag"><span class="easy">easy</span></span></a></li>
<li><a href="#org060b4a4"><span class="done DONE">DONE</span> Valid parenthesis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="easy">easy</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org01e1879" class="outline-2">
<h2 id="org01e1879"><code>[2/2]</code> Leetcode Exercises <span class="timestamp-wrapper"><span class="timestamp">[2022-06-21 Tue]</span></span></h2>
<div class="outline-text-2" id="text-org01e1879">
</div>
<div id="outline-container-org42e024d" class="outline-3">
<h3 id="org42e024d"><span class="done DONE">DONE</span> Two Sum&#xa0;&#xa0;&#xa0;<span class="tag"><span class="easy">easy</span></span></h3>
<div class="outline-text-3" id="text-org42e024d">
<dl class="org-dl">
<dt>Runtime</dt><dd>O(n) 71%</dd>
<dt>Memory</dt><dd>O(n) 49%</dd>
<dt>(no term)</dt><dd>Use a dictionary to store potential matches for future numbers.</dd>
</dl>
</div>
</div>
<div id="outline-container-org060b4a4" class="outline-3">
<h3 id="org060b4a4"><span class="done DONE">DONE</span> Valid parenthesis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="easy">easy</span></span></h3>
<div class="outline-text-3" id="text-org060b4a4">
<dl class="org-dl">
<dt>Runtime</dt><dd>O(n) 19%</dd>
<dt>Memory</dt><dd>O(n) 69%</dd>
<dt>(no term)</dt><dd>Use a stack to keep the open parenthesis in order.</dd>
<dt>(no term)</dt><dd>if <code>([{</code>, then push. if <code>)]}</code>, check the correspondence and if ok, continue.</dd>
<dt>(no term)</dt><dd>Keep the pairs in a dictionary, that makes it easy to maintain.</dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Claudio Parra</p>
<p class="email">Email: <a href="mailto:onlycparra@hotmail.com">onlycparra@hotmail.com</a></p>
<p class="date">Created: 2022-06-21 Tue 23:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
